Revit 2026 API

# TableSectionDataNeedsRefresh Property

---

Indicates if the table data need to refresh.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool NeedsRefresh { get; set; }
```
```vb
Public Property NeedsRefresh As Boolean
	Get
	Set
```
```cpp
public:
property bool NeedsRefresh {
	bool get ();
	void set (bool value);
}
```
```fsharp
member NeedsRefresh : bool with get, set
```

#### Property Value

Boolean

| Exception | Condition |
| --- | --- |
| InvalidOperationException | When setting this property: This operation is forbidden for cells in standard schedule body sections. |

#### Reference

TableSectionData Class

Autodesk.Revit.DB Namespace